code-review/NRB_3471_3546/База_Было/InformationRegisters/ЛимитыПримененияСтавокНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛимитыПримененияСтавокНДФЛ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтавкаНДФЛ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ЛимитыПримененияСтавокНДФЛ/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция получает значение лимита применения заданной ставки НДФЛ на указанную дату
//
// Параметры:
//  Дата - Дата - Дата для получения лимита
//  СтавкаНДФЛ - ПеречислениеСсылка.НДФЛСтавки - Ставка НДФЛ для получения лимита
// 
// Возвращаемое значение:
//  Число - Значение лимита
//
Функция ЛимитНаДату(Дата, СтавкаНДФЛ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛимитыПримененияСтавокНДФЛ.Лимит КАК Лимит
	|ИЗ
	|	РегистрСведений.ЛимитыПримененияСтавокНДФЛ.СрезПоследних(&Дата, СтавкаНДФЛ = &СтавкаНДФЛ) КАК ЛимитыПримененияСтавокНДФЛ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("СтавкаНДФЛ", СтавкаНДФЛ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Лимит = 0;
	Если Выборка.Следующий() Тогда
		Лимит = Выборка.Лимит;
	КонецЕсли;
	
	Возврат Лимит;
КонецФункции

// Процедура добавляет новую запись в регистр сведений с заданными значениями периода и лимита
//
// Параметры:
//  Период - Дата - Период
//  СтавкаНДФЛ - ПеречислениеСсылка.НДФЛСтавки - Ставка НДФЛ
//  Лимит - Число - Лимит
//
Процедура ДобавитьЗапись(Период, СтавкаНДФЛ, Лимит) Экспорт
	МенеджерЗаписи = РегистрыСведений.ЛимитыПримененияСтавокНДФЛ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.СтавкаНДФЛ = СтавкаНДФЛ;
	МенеджерЗаписи.Лимит = Лимит;
	МенеджерЗаписи.Записать();
КонецПроцедуры

#КонецОбласти
